export default {
  nav: {
    home: 'الصفحة الرئيسية',
    articles: 'المقالات',
    about: 'حول',
    connect: 'تسجيل الدخول',
    search: 'بحث',

    profile: 'الملف الشخصي',
    orders: 'الطلبات',
    dashboard: 'لوحة القيادة',
    logout: 'تسجيل الخروج'
  },

  home: {
    titre1: 'اكتشف منتجاتنا الأكثر شهرة',
    addButton: 'إضافة',
    title2: 'ابحث عن احتياجاتك الخاصة!',
    books: 'الكتب',
    supplies: 'اللوازم',
    artsAndToys: 'الفنون والألعاب',
    services: 'الخدمات',
    school: 'المدرسة',

    collections: 'ابحث عن المجموعة التي تناسبك',
    disbtn: 'اكتشف',

    ourImpact: 'أثرنا بالأرقام',
    ourImpactResults: 'نتائج تتحدث عن نفسها',

    SatisfiedCustomers: 'العملاء الراضون',
    poductsSold: 'المنتجات المباعة',
    averageRating: 'التقييم المتوسط',
    satisfactionRate: 'معدل الرضا',

    motivationTitle: 'ابحث عن دافعك',
    motivationQuote: 'يجب أن تكون مركزًا ومصممًا. ثم ستصل إلى ما تريد.',
    motivationText: 'من الطفولة المتواضعة إلى إنشاء مكتبة استثنائية، تُظهر قصتنا أنه مع العزيمة والعمل الجاد، كل شيء ممكن. نشارك هذه الشغف بالتميز والتعلم المستمر مع مجتمعنا.',
    motivationDis: 'اكتشف مواردنا',
    motivationExp: 'استكشف مدونتنا',

    review: 'مراجعات عملائنا',
    reviewQuote: 'ما يعتقده عملاؤنا الراضون',

    location: 'موقعنا',
    signService: 'اشترك في خدمتنا',
    signupEmail: 'اشترك'
  },

  footer: {
    wish: 'نتمنى لك تجربة ممتعة يمكنك قراءة الموقع الإلكتروني'
  },

  about: {
    title: 'حول Eqrae',
    subtitle: 'شريكك الموثوق في مغامرة المعرفة',
    history: {
      title: 'قصتنا',
      content: 'تأسست Eqrae في عام 2020، ولدت من رؤية مجموعة من عشاق التعليم الذين كانوا مصممين على جعل المعرفة أكثر سهولة. بدأت مكتبتنا بشكل متواضع، ولكن مع طموح واضح: أن نصبح مكانًا للتميز في التعلم والاكتشاف. اليوم، نحن فخورون بخدمة مجتمع متنامي من المتعلمين والقراء الشغوفين، مقدّمين لهم ليس فقط الكتب ولكن أيضًا الأدوات والموارد لإثراء رحلتهم التعليمية.'
    },
    values: {
      title: 'قيمنا',
      passion: 'الطموح',
      passionDescription: 'نحن شغوفون بالتعليم ونقل المعرفة.',
      community: 'المجتمع',
      communityDescription: 'نخلق بيئة تعليمية تعاونية وشاملة.',
      excellence: 'التميز',
      excellenceDescription: 'نهدف إلى التميز في كل جانب من جوانب خدماتنا.',
      quality: 'الجودة',
      qualityDescription: 'نختار منتجاتنا بدقة لضمان أفضل جودة.'
    }
  },

  articles: {
    title1: 'مرحبًا بك في متجرنا!',
    text: 'يسعدنا أن نرحب بك في فضائنا المخصص للإمدادات ذات الجودة العالية.',
    title2: 'تسوق، اختر منتجاتك'
  },

  article: {
    price: 'السعر',
    stock: 'المخزون',
    created_at: 'تاريخ الإنشاء',
    add: 'أضف إلى السلة'
  },

  order: {
    yourProduct: 'منتجاتك',
    price: 'السعر',
    stock: 'المخزون',
    quantity: 'الكمية',
    enterInfo: 'أدخل معلوماتك',
    order: 'ط ل ب',
    messege1: 'يرجى',
    messege2: 'تسجيل الدخول',
    messege3: 'لطلب المنتجات في اللوحة أو',
    messege4: 'إنشاء حساب جديد',

    free_delivery_message: "طلبك سيتم توصيله مجانًا",
    delivery_message: "التوصيل يبدأ من 15 درهم"
  },

  empty: {
    text1: 'لم يتم اختيار منتجات',
    text2: 'يبدو أنك لم تضف أي منتجات إلى سلتك.',
    text3: 'العودة إلى الصفحة الرئيسية',
    text4: 'العودة إلى المتجر'
  },


  loginForm: {
    title: "تسجيل الدخول",
    email: "البريد الإلكتروني",
    password: "كلمة المرور",
    rememberMe: "تذكرني",
    submit: "إرسال",
    signUp: "إنشاء حساب",
    acceptwebsiteterms: "لقد قرأت وقبلت",
    forgotPassword: "هل نسيت كلمة المرور؟",
    loginSuccess: "تم تسجيل الدخول بنجاح!",
    loginFailed: "فشل في تسجيل الدخول",
    serverError: "حدث خطأ في الاتصال بالخادم"
  },

  signup: {
    title: "التسجيل",
    email: "البريد الإلكتروني",
    password: "كلمة المرور",
    confirmPassword: "تأكيد كلمة المرور",
    rememberMe: "تذكرني",
    submit: "إرسال",
    login: "تسجيل الدخول"
  },

  sidebar: {
    dashboard: "لوحة القيادة",
    profile: "الملف الشخصي",
    orders: "الطلبات",
    package: "الحزمة",
    clients: "العملاء",
    welcomeMessage: "أهلاً بك",
    logout: "تسجيل الخروج",
    back: "الرجوع"
  },


  terms: {
    title: "الشروط والأحكام",
    use_of_website: {
      title: "استخدام الموقع الإلكتروني",
      point_1: "من خلال الوصول إلى هذا الموقع واستخدامه، فإنك توافق على الالتزام بهذه الشروط والأحكام.",
      point_2: "يجب على المستخدمين تقديم معلومات دقيقة وكاملة عند التسجيل أو تقديم طلب.",
      point_3: "تم تصميم الموقع للاستخدام القانوني فقط. قد تؤدي الأنشطة الاحتيالية أو إساءة استخدام المنصة إلى تعليق أو إنهاء الحساب."
    },
    rules: {
      title: "قواعد الشراء والإرجاع أو الإلغاء",
      point_1: "يمكن للعملاء تقديم طلبات شراء المنتجات المتوفرة في المتجر الإلكتروني.",
      point_2: "سيتم رفض الطلبات التي تحتوي على أكثر من 10 وحدات من نفس المنتج تلقائيًا.",
      point_3: "بمجرد تقديم الطلب، يجب طلب الإلغاء قبل شحن المنتج. يحتفظ المسؤولون بالحق في الموافقة على الإلغاءات أو رفضها.",
      point_4: "لن يتم قبول الإرجاع إلا إذا كان المنتج تالفًا أو معيبًا، شريطة تقديم طلب الإرجاع في غضون 7 أيام من التسليم.",
      point_5: "ستتم معالجة المبالغ المستردة للإرجاعات المعتمدة في غضون 14 يومًا."
    },
    admin: {
      title: "صلاحيات الإدارة",
      point_1: "يحق للإدارة قبول أو رفض أي طلب بناءً على توفر المنتج أو شروط أخرى.",
      point_2: "يمكن للإدارة حذف حسابات المستخدمين إذا تبين أنها مزيفة أو متورطة في أنشطة احتيالية."
    },
    delivery: {
      title: "سياسة التسليم",
      point_1: "تتوفر خياران للتسليم: الدفع عند الاستلام واستلام المنتج من المتجر.",
      point_2: "سيتم إبلاغ المستخدمين بمواعيد التسليم أثناء عملية الطلب.",
      point_3: "لا يتحمل الموقع مسؤولية التأخير الناتج عن خدمات التوصيل الخارجية."
    },
    liability: {
      title: "إخلاء المسؤولية",
      point_1: "يتم تقديم المنتجات والخدمات على الموقع 'كما هي' دون ضمان لدقة أو اكتمال أو موثوقية المعلومات.",
      point_2: "يتم استخدام بيانات وهمية أو تجريبية على المنصة؛ أي تشابه مع أشخاص أو كيانات حقيقية هو محض صدفة.",
      point_3: "لن يكون الموقع مسؤولاً عن أي أضرار غير مباشرة أو عرضية أو تبعية ناجمة عن استخدام المنصة."
    }
  },
  privacy: {
    title: "سياسة الخصوصية",
    data_collection: {
      title: "ممارسات جمع البيانات",
      point_1: "يجمع الموقع معلومات شخصية مثل الأسماء وعناوين البريد الإلكتروني وأرقام الهواتف وعناوين التسليم أثناء التسجيل وطلب المنتجات.",
      point_2: "تُستخدم ملفات تعريف الارتباط وأدوات التحليل لتحسين تجربة المستخدم ومراقبة أداء الموقع."
    },
    data_usage: {
      title: "استخدام البيانات ومشاركتها",
      point_1: "تُستخدم البيانات المجمعة لمعالجة الطلبات وتسليمها، والتواصل مع المستخدمين، وتحسين وظائف الموقع.",
      point_2: "لا تتم مشاركة البيانات مع أطراف ثالثة، إلا في حالة خدمات التوصيل إذا لزم الأمر."
    },
    users_rights: {
      title: "حقوق المستخدمين",
      point_1: "يحق للمستخدمين الوصول إلى بياناتهم الشخصية وتصحيحها أو حذفها من المنصة.",
      point_2: "لممارسة هذه الحقوق، يمكن للمستخدمين التواصل مع الدعم عبر القنوات المتاحة."
    },
    security: {
      title: "تدابير الأمان",
      point_1: "يستخدم الموقع بروتوكولات أمان لحماية بيانات المستخدمين من الوصول غير المصرح به أو الضياع أو سوء الاستخدام.",
      point_2: "المستخدمون مسؤولون عن الحفاظ على سرية بيانات تسجيل الدخول الخاصة بهم."
    }
  }

};
